In [1]:
import pandas as pd
import numpy as np

In [2]:
df =pd.read_csv('u.data' , sep = '\t')

In [3]:
df.head()

   196  242  3  881250949
0  186  302  3  891717742
1   22  377  1  878887116
2  244   51  2  880606923
3  166  346  1  886397596
4  298  474  4  884182806

In [4]:
columns = ['user_id' , 'item_id' , 'rating' , 'timestamp']

In [5]:
df =pd.read_csv('u.data' , sep = '\t' , names = columns)

In [6]:
df.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [7]:
movies_titles = pd.read_csv('u.item' , sep = '\|', header = None)

<ipython-input-7-cbb6b860e30c>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies_titles = pd.read_csv('u.item' , sep = '\|', header = None)

In [8]:
movies_titles.head()

,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,23
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [9]:
movies_titles = movies_titles[[0,1]]

In [10]:
movies_titles.head()

   0                  1
0  1   Toy Story (1995)
1  2   GoldenEye (1995)
2  3  Four Rooms (1995)
3  4  Get Shorty (1995)
4  5     Copycat (1995)

In [11]:
movies_titles.columns = ['item_id' , "title"]
movies_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [12]:
#now we will merge these two dataframes
df = pd.merge(df, movies_titles, on = 'item_id')
df.tail()

,user_id,item_id,rating,timestamp,title
99995,840,1674,4,891211682,Mamma Roma (1962)
99996,655,1640,3,888474646,"Eighth Day, The (1996)"
99997,655,1637,3,888984255,Girls Town (1996)
99998,655,1630,3,887428735,"Silence of the Palace, The (Saimt el Qusur) (1..."
99999,655,1641,3,887427810,Dadetown (1995)

# Exploratory Data Analysis

In [13]:
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_style('white')

In [14]:
df.groupby('title').mean() [ 'rating'].sort_values(ascending = False)

title
They Made Me a Criminal (1939)                  5.0
Marlene Dietrich: Shadow and Light (1996)       5.0
Saint of Fort Washington, The (1993)            5.0
Someone Else's America (1995)                   5.0
Star Kid (1997)                                 5.0
                                               ...
Eye of Vichy, The (Oeil de Vichy, L') (1993)    1.0
King of New York (1990)                         1.0
Touki Bouki (Journey of the Hyena) (1973)       1.0
Bloody Child, The (1996)                        1.0
Crude Oasis, The (1995)                         1.0
Name: rating, Length: 1664, dtype: float64

In [15]:
df.groupby('title').count() [ 'rating'].sort_values(ascending = False)

title
Star Wars (1977)                      583
Contact (1997)                        509
Fargo (1996)                          508
Return of the Jedi (1983)             507
Liar Liar (1997)                      485
                                     ...
Great Day in Harlem, A (1994)           1
Other Voices, Other Rooms (1997)        1
Good Morning (1971)                     1
Girls Town (1996)                       1
� k�ldum klaka (Cold Fever) (1994)      1
Name: rating, Length: 1664, dtype: int64

In [16]:
ratings = pd.DataFrame (df.groupby('title').mean() [ 'rating'])
ratings.head()

                             rating
title
'Til There Was You (1997)  2.333333
1-900 (1994)               2.600000
101 Dalmatians (1996)      2.908257
12 Angry Men (1957)        4.344000
187 (1997)                 3.024390

In [17]:
ratings['No. of Ratings']= pd.DataFrame(df.groupby('title').count() [ 'rating'])
ratings.head()

                             rating  No. of Ratings
title
'Til There Was You (1997)  2.333333               9
1-900 (1994)               2.600000               5
101 Dalmatians (1996)      2.908257             109
12 Angry Men (1957)        4.344000             125
187 (1997)                 3.024390              41

In [18]:
ratings.sort_values(by = "rating" , ascending = False)

                                              rating  No. of Ratings
title
They Made Me a Criminal (1939)                   5.0               1
Marlene Dietrich: Shadow and Light (1996)        5.0               1
Saint of Fort Washington, The (1993)             5.0               2
Someone Else's America (1995)                    5.0               1
Star Kid (1997)                                  5.0               3
...                                              ...             ...
Eye of Vichy, The (Oeil de Vichy, L') (1993)     1.0               1
King of New York (1990)                          1.0               1
Touki Bouki (Journey of the Hyena) (1973)        1.0               1
Bloody Child, The (1996)                         1.0               1
Crude Oasis, The (1995)                          1.0               1

[1664 rows x 2 columns]

In [19]:
""" we will be plotting histogram to see the distribution"""
plt.figure(figsize=(10 , 6))
plt.hist(ratings['No. of Ratings'] , bins = 70)
plt.show()     """here we can see that number of times someone has rated a movie vs how many times rating has appeared    """

SyntaxError: invalid syntax (<ipython-input-19-0c8b56aa5a61>, line 4)

In [ ]:
plt.hist(ratings['rating'] , bins = 70)
plt.show()

In [ ]:
sns.jointplot(x = 'rating' , y ='No. of Ratings' , data = ratings , alpha = 0.5)

# Creating Movie Recommendation

In [ ]:
movie_mat = df.pivot_table(index = 'user_id' , columns = 'title' , values = 'rating')

In [ ]:
movie_mat

In [ ]:
ratings.sort_values("No. of Ratings" , ascending = False).head()

In [ ]:
starwars_user_ratings = movie_mat['Star Wars (1977)']
starwars_user_ratings.head()

In [ ]:
similar_to_starwars = movie_mat.corrwith(starwars_user_ratings)

In [ ]:
similar_to_starwars

In [ ]:
corr_starwars= pd.DataFrame(similar_to_starwars, columns = ['Correlation'])
corr_starwars.dropna(inplace = True)
corr_starwars.head()

In [ ]:
corr_starwars.sort_values('Correlation' , ascending = False).head(10)

In [ ]:
corr_starwars= corr_starwars.join(ratings["No. of Ratings"])
corr_starwars.head()

In [ ]:
corr_starwars[corr_starwars['No. of Ratings']>100].sort_values ('Correlation', ascending = False)

# Predict Function

In [ ]:
def predict_movies(movie_name):
    movie_user_ratings = movie_mat[movie_name]
    similar_to_movie_name = movie_mat.corrwith(movie_user_ratings)
    
    corr_movie_name= pd.DataFrame(similar_to_movie_name, columns = ['Correlation'])
    corr_movie_name.dropna(inplace = True)
    
    corr_movie_name.sort_values('Correlation' , ascending = False)
    
    corr_movie_name= corr_movie_name.join(ratings["No. of Ratings"])
    
    predictions = corr_movie_name[corr_movie_name['No. of Ratings']>100].sort_values ('Correlation', ascending = False)
    
    return predictions

In [ ]:
predictions = predict_movies("GoldenEye (1995)")

In [ ]:
predictions.head()